src/main/resources/xml/accommodationSalesServicePort/cancelWithRefund/cancelWithRefund.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:cancelWithRefund>
         <request>
            <cancelContactName>?</cancelContactName>
            <cancelDate>?</cancelDate>
            <cancelReasonCode>?</cancelReasonCode>
            <externalReferenceDetail>
               <!--Optional:-->
               <externalReferenceType>?</externalReferenceType>
               <!--Optional:-->
               <externalReferenceCode>?</externalReferenceCode>
               <!--Optional:-->
               <externalReferenceNumber>?</externalReferenceNumber>
               <!--Optional:-->
               <externalReferenceSource>?</externalReferenceSource>
            </externalReferenceDetail>
            <overridden>?</overridden>
            <waived>?</waived>
            <overriddenCancelFee>?</overriddenCancelFee>
            <travelComponentGroupingId>?</travelComponentGroupingId>
            <cancelTickets>?</cancelTickets>
         </request>
         <refundPaymentRequest>
            <membershipId>?</membershipId>
            <cancelDate>?</cancelDate>
            <refundType>?</refundType>
            <refundInformation>
               <!--Optional:-->
               <paymentReferenceValue>?</paymentReferenceValue>
               <!--Optional:-->
               <transactionId>?</transactionId>
               <stayDetails>
                  <reservationType>?</reservationType>
                  <!--Optional:-->
                  <resortCode>?</resortCode>
                  <!--Optional:-->
                  <resortType>?</resortType>
                  <!--Optional:-->
                  <reservationNumber>?</reservationNumber>
                  <!--Optional:-->
                  <reservationReferenceNo>?</reservationReferenceNo>
                  <homeType>?</homeType>
                  <arrivalDate>?</arrivalDate>
                  <departureDate>?</departureDate>
                  <!--Optional:-->
                  <bookingDate>?</bookingDate>
               </stayDetails>
               <!--Optional:-->
               <refundAmount>
                  <currency>?</currency>
                  <amount>?</amount>
               </refundAmount>
               <cancelWithoutPenalty>?</cancelWithoutPenalty>
            </refundInformation>
         </refundPaymentRequest>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:cancelWithRefund>
   </soapenv:Body>
</soapenv:Envelope>